#+title: Roda + Sequel
#+subtitle: maybe its time to move past sinatra
#+tags[]: ruby, roda, sequel
#+date: 2024-08-27T06:30:10

Sinatra is getitng a bit old in the teeth, and there are a couple of
other ruby api frameworks out there.  [[https://roda.jeremyevans.net/compare_to_sinatra.html][Roda]] by Jeremy Evans seems like
it is another interesting one -- that and [[https://hanamirb.org/][Hanami]] -- and since he did
[[https://sequel.jeremyevans.net/][sequel]] I thought I'd explore what it would take.

So lets get going!

#+begin_src bash
  bundle init
  bundle add rerun roda puma
#+end_src

#+begin_src ruby :tangle config.ru
  # config.ru

  require_relative 'app'

  run App.app
#+end_src

#+begin_src ruby :tangle app_1.rb
  require 'roda'

  class App < Roda
    route do |r|
      r.root do
        "Hello there"
      end
    end
  end
#+end_src

#+begin_src bash
  rerun rackup
#+end_src

* Adding sequel

This took me a bit to figure out.  Sequel has a slightly different
model than ActiveRecord does, and [[https://speakerdeck.com/janko_m/sequel-when-activerecord-is-not-enough][here's a nice introduction to it.]]

Both roda and sequel are very plugin heavy, which is sort of
refreshing.

#+begin_src bash
  bundle add sequel sqlite3 dotenv
  mkdir -p db/migrations
#+end_src

=.env=:

#+begin_src bash :tangle .env
  DATABASE_URL=sqlite://./db/development.db
#+end_src

#+begin_src ruby :tangle db/migrations/001_accounts.rb
  # db/migrations/001_accounts.rb

  puts "Loading up migration"

  Sequel.migration do
    change do
      create_table(:accounts) do
        primary_key :id
        String :email, null: false
        Boolean :confirmed, default: false
        String :name
        String :login_hash
        DateTime :hash_valid_until, null: true
        DateTime :created_at, null: false
        DateTime :updated_at, null: false
      end
    end
  end
#+end_src

=db.rb=:
#+begin_src ruby :tangle db.rb
  require 'dotenv/load'
  require 'sequel'

  throw "DATABASE_URL is unset" if !ENV['DATABASE_URL'] || ENV['DATABASE_URL'] == ""

  DB = Sequel.connect( ENV['DATABASE_URL'] )

  Sequel::Model.plugin :timestamps, update_on_create: true
#+end_src

=Rakefile=:

#+begin_src ruby :tangle Rakefile
  require 'dotenv/load'

  namespace :db do
    desc "Migration the database"
    task :migrate do
      puts "Calling db:migrate"
      require_relative 'db.rb'
      version = nil
      
      Sequel.extension(:migration)
      
      # Perform migrations based on migration files in a specified directory.
      Sequel::Migrator.apply(DB, 'db/migrations')
      
      # Dump database schema after migration.
      #Rake::Task['db:dump'].invoke
    end
  end
#+end_src

#+begin_src bash :results output
  dotenvx run -- rake db:migrate 
#+end_src

#+RESULTS:
: [dotenvx@1.6.4] injecting env (1) from .env
: Calling db:migrate


** Debug

#+begin_src bash :results output
  curl http://localhost:9292/account 
#+end_src

#+RESULTS:
: Post to create an account

Creating a new account:

#+begin_src bash :results output
  curl -X POST \
       -F name=Will \
       -F email=wschenk@gmail.com \
       http://localhost:9292/account
#+end_src

#+RESULTS:
: Hash is 174b8bcc0d58ca52b0b2b2b36f326397

Calling it without a hash

#+begin_src bash :results output
  curl http://localhost:9292/account/hash
#+end_src

#+RESULTS:

Calling it with the hash (the idea is that the account is verified)

#+begin_src bash :results output
  curl http://localhost:9292/account/hash/174b8bcc0d58ca52b0b2b2b36f326397
#+end_src

#+RESULTS:
: Hello wschenk@gmail.com

